<?xml version="1.0" ?>
<net name="hand_landmark" version="10">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,3,224,224"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input_1/reverse_input_channels/Concat12138_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="24,3,3,3" size="1296"/>
			<output>
				<port id="0" names="Conv2D/filter:0" precision="FP16">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Add/y/EltwiseUnsqueeze5522_const" type="Const" version="opset1">
			<data element_type="f16" offset="1296" shape="1,24,1,1" size="48"/>
			<output>
				<port id="0" names="Add/y:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="model/model/tf.nn.relu6/Relu6_model/model/batch_normalization/FusedBatchNormV3_model/model/batch_normalization_1/FusedBatchNormV3_model/model/depthwise_conv2d/depthwise_model/model/conv2d_9/Conv2D_model/model/conv2d/Conv2D" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model/model/tf.nn.relu6/Relu6_model/model/batch_normalization/FusedBatchNormV3_model/model/batch_normalization_1/FusedBatchNormV3_model/model/depthwise_conv2d/depthwise_model/model/conv2d_9/Conv2D_model/model/conv2d/Conv2D:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="1263712640_const" type="Const" version="opset1">
			<data element_type="f16" offset="1344" shape="24,1,1,3,3" size="432"/>
			<output>
				<port id="0" names="depthwise/filter_in:0" precision="FP16">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Add_1/y/EltwiseUnsqueeze5526_const" type="Const" version="opset1">
			<data element_type="f16" offset="1776" shape="1,24,1,1" size="48"/>
			<output>
				<port id="0" names="Add_1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_1:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="model/model/tf.nn.relu6_1/Relu6_model/model/batch_normalization_1/FusedBatchNormV3_model/model/depthwise_conv2d/depthwise_model/model/conv2d_9/Conv2D" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model/model/tf.nn.relu6_1/Relu6_model/model/batch_normalization_1/FusedBatchNormV3_model/model/depthwise_conv2d/depthwise_model/model/conv2d_9/Conv2D:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Conv2D_1/Transpose7972_const" type="Const" version="opset1">
			<data element_type="f16" offset="1824" shape="8,24,1,1" size="384"/>
			<output>
				<port id="0" names="Conv2D_1/filter:0" precision="FP16">
					<dim>8</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Conv2D_1" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_1:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="model/model/batch_normalization_2/FusedBatchNormV3_model/model/conv2d_1/Conv2D1/y/EltwiseUnsqueeze5530_const" type="Const" version="opset1">
			<data element_type="f16" offset="2208" shape="1,8,1,1" size="16"/>
			<output>
				<port id="0" names="model/model/batch_normalization_2/FusedBatchNormV3_model/model/conv2d_1/Conv2D1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="model/model/batch_normalization_2/FusedBatchNormV3_model/model/conv2d_1/Conv2D1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/model/batch_normalization_2/FusedBatchNormV3_model/model/conv2d_1/Conv2D1:0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Conv2D_2/Transpose7976_const" type="Const" version="opset1">
			<data element_type="f16" offset="2224" shape="32,8,1,1" size="512"/>
			<output>
				<port id="0" names="Conv2D_2/filter:0" precision="FP16">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Conv2D_2" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_2:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Add_2/y/EltwiseUnsqueeze5534_const" type="Const" version="opset1">
			<data element_type="f16" offset="2736" shape="1,32,1,1" size="64"/>
			<output>
				<port id="0" names="Add_2/y:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_2:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="model/model/tf.nn.relu6_2/Relu6_model/model/batch_normalization_3/FusedBatchNormV3_model/model/batch_normalization_4/FusedBatchNormV3_model/model/depthwise_conv2d_1/depthwise_model/model/conv2d_2/Conv2D" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model/model/tf.nn.relu6_2/Relu6_model/model/batch_normalization_3/FusedBatchNormV3_model/model/batch_normalization_4/FusedBatchNormV3_model/model/depthwise_conv2d_1/depthwise_model/model/conv2d_2/Conv2D:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="1266912672_const" type="Const" version="opset1">
			<data element_type="f16" offset="2800" shape="32,1,1,3,3" size="576"/>
			<output>
				<port id="0" names="depthwise_1/filter_in:0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="depthwise_1" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_1:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Add_3/y/EltwiseUnsqueeze5538_const" type="Const" version="opset1">
			<data element_type="f16" offset="3376" shape="1,32,1,1" size="64"/>
			<output>
				<port id="0" names="Add_3/y:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Add_3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_3:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="model/model/tf.nn.relu6_3/Relu6_model/model/batch_normalization_4/FusedBatchNormV3_model/model/depthwise_conv2d_1/depthwise" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model/model/tf.nn.relu6_3/Relu6_model/model/batch_normalization_4/FusedBatchNormV3_model/model/depthwise_conv2d_1/depthwise:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Conv2D_3/Transpose7984_const" type="Const" version="opset1">
			<data element_type="f16" offset="3440" shape="16,32,1,1" size="1024"/>
			<output>
				<port id="0" names="Conv2D_3/filter:0" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Conv2D_3" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_3:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="model/model/batch_normalization_5/FusedBatchNormV3_model/model/conv2d_5/Conv2D_model/model/conv2d_3/Conv2D1/y/EltwiseUnsqueeze5542_const" type="Const" version="opset1">
			<data element_type="f16" offset="4464" shape="1,16,1,1" size="32"/>
			<output>
				<port id="0" names="model/model/batch_normalization_5/FusedBatchNormV3_model/model/conv2d_5/Conv2D_model/model/conv2d_3/Conv2D1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="model/model/batch_normalization_5/FusedBatchNormV3_model/model/conv2d_5/Conv2D_model/model/conv2d_3/Conv2D1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/model/batch_normalization_5/FusedBatchNormV3_model/model/conv2d_5/Conv2D_model/model/conv2d_3/Conv2D1:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv2D_4/Transpose7988_const" type="Const" version="opset1">
			<data element_type="f16" offset="4496" shape="96,16,1,1" size="3072"/>
			<output>
				<port id="0" names="Conv2D_4/filter:0" precision="FP16">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv2D_4" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_4:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Add_4/y/EltwiseUnsqueeze5546_const" type="Const" version="opset1">
			<data element_type="f16" offset="7568" shape="1,96,1,1" size="192"/>
			<output>
				<port id="0" names="Add_4/y:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Add_4" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_4:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="model/model/tf.nn.relu6_4/Relu6_model/model/batch_normalization_6/FusedBatchNormV3_model/model/batch_normalization_10/FusedBatchNormV3_model/model/depthwise_conv2d_3/depthwise_model/model/conv2d_29/Conv2D_model/model/conv2d_4/Conv2D" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model/model/tf.nn.relu6_4/Relu6_model/model/batch_normalization_6/FusedBatchNormV3_model/model/batch_normalization_10/FusedBatchNormV3_model/model/depthwise_conv2d_3/depthwise_model/model/conv2d_29/Conv2D_model/model/conv2d_4/Conv2D:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="1264112644_const" type="Const" version="opset1">
			<data element_type="f16" offset="7760" shape="96,1,1,3,3" size="1728"/>
			<output>
				<port id="0" names="depthwise_2/filter_in:0" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="depthwise_2" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_2:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Add_5/y/EltwiseUnsqueeze5550_const" type="Const" version="opset1">
			<data element_type="f16" offset="9488" shape="1,96,1,1" size="192"/>
			<output>
				<port id="0" names="Add_5/y:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Add_5" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_5:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="model/model/tf.nn.relu6_5/Relu6_model/model/batch_normalization_7/FusedBatchNormV3_model/model/batch_normalization_10/FusedBatchNormV3_model/model/depthwise_conv2d_3/depthwise_model/model/conv2d_29/Conv2D_model/model/depthwise_conv2d_2/depthwise" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model/model/tf.nn.relu6_5/Relu6_model/model/batch_normalization_7/FusedBatchNormV3_model/model/batch_normalization_10/FusedBatchNormV3_model/model/depthwise_conv2d_3/depthwise_model/model/conv2d_29/Conv2D_model/model/depthwise_conv2d_2/depthwise:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv2D_5/Transpose7996_const" type="Const" version="opset1">
			<data element_type="f16" offset="9680" shape="16,96,1,1" size="3072"/>
			<output>
				<port id="0" names="Conv2D_5/filter:0" precision="FP16">
					<dim>16</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv2D_5" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_5:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="model/model/batch_normalization_8/FusedBatchNormV3_model/model/conv2d_5/Conv2D1/y/EltwiseUnsqueeze5554_const" type="Const" version="opset1">
			<data element_type="f16" offset="12752" shape="1,16,1,1" size="32"/>
			<output>
				<port id="0" names="model/model/batch_normalization_8/FusedBatchNormV3_model/model/conv2d_5/Conv2D1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="model/model/batch_normalization_8/FusedBatchNormV3_model/model/conv2d_5/Conv2D1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/model/batch_normalization_8/FusedBatchNormV3_model/model/conv2d_5/Conv2D1:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="model/model/tf.__operators__.add/AddV2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/model/tf.__operators__.add/AddV2:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Conv2D_6/Transpose8000_const" type="Const" version="opset1">
			<data element_type="f16" offset="12784" shape="96,16,1,1" size="3072"/>
			<output>
				<port id="0" names="Conv2D_6/filter:0" precision="FP16">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv2D_6" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_6:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Add_6/y/EltwiseUnsqueeze5558_const" type="Const" version="opset1">
			<data element_type="f16" offset="15856" shape="1,96,1,1" size="192"/>
			<output>
				<port id="0" names="Add_6/y:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Add_6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_6:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="model/model/tf.nn.relu6_6/Relu6_model/model/batch_normalization_9/FusedBatchNormV3_model/model/batch_normalization_10/FusedBatchNormV3_model/model/depthwise_conv2d_3/depthwise_model/model/conv2d_29/Conv2D_model/model/conv2d_6/Conv2D" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model/model/tf.nn.relu6_6/Relu6_model/model/batch_normalization_9/FusedBatchNormV3_model/model/batch_normalization_10/FusedBatchNormV3_model/model/depthwise_conv2d_3/depthwise_model/model/conv2d_29/Conv2D_model/model/conv2d_6/Conv2D:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="1260512608_const" type="Const" version="opset1">
			<data element_type="f16" offset="16048" shape="96,1,1,5,5" size="4800"/>
			<output>
				<port id="0" names="depthwise_3/filter_in:0" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="depthwise_3" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_3:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Add_7/y/EltwiseUnsqueeze5562_const" type="Const" version="opset1">
			<data element_type="f16" offset="20848" shape="1,96,1,1" size="192"/>
			<output>
				<port id="0" names="Add_7/y:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Add_7" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_7:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="model/model/tf.nn.relu6_7/Relu6_model/model/batch_normalization_10/FusedBatchNormV3_model/model/depthwise_conv2d_3/depthwise_model/model/conv2d_29/Conv2D" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model/model/tf.nn.relu6_7/Relu6_model/model/batch_normalization_10/FusedBatchNormV3_model/model/depthwise_conv2d_3/depthwise_model/model/conv2d_29/Conv2D:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Conv2D_7/Transpose8008_const" type="Const" version="opset1">
			<data element_type="f16" offset="21040" shape="24,96,1,1" size="4608"/>
			<output>
				<port id="0" names="Conv2D_7/filter:0" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv2D_7" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_7:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="model/model/batch_normalization_11/FusedBatchNormV3_model/model/conv2d_9/Conv2D_model/model/conv2d_7/Conv2D1/y/EltwiseUnsqueeze5566_const" type="Const" version="opset1">
			<data element_type="f16" offset="25648" shape="1,24,1,1" size="48"/>
			<output>
				<port id="0" names="model/model/batch_normalization_11/FusedBatchNormV3_model/model/conv2d_9/Conv2D_model/model/conv2d_7/Conv2D1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="model/model/batch_normalization_11/FusedBatchNormV3_model/model/conv2d_9/Conv2D_model/model/conv2d_7/Conv2D1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/model/batch_normalization_11/FusedBatchNormV3_model/model/conv2d_9/Conv2D_model/model/conv2d_7/Conv2D1:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Conv2D_8/Transpose8012_const" type="Const" version="opset1">
			<data element_type="f16" offset="25696" shape="144,24,1,1" size="6912"/>
			<output>
				<port id="0" names="Conv2D_8/filter:0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv2D_8" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_8:0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Add_8/y/EltwiseUnsqueeze5570_const" type="Const" version="opset1">
			<data element_type="f16" offset="32608" shape="1,144,1,1" size="288"/>
			<output>
				<port id="0" names="Add_8/y:0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Add_8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_8:0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="model/model/tf.nn.relu6_8/Relu6_model/model/batch_normalization_12/FusedBatchNormV3_model/model/batch_normalization_16/FusedBatchNormV3_model/model/depthwise_conv2d_5/depthwise_model/model/conv2d_31/Conv2D_model/model/conv2d_8/Conv2D" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model/model/tf.nn.relu6_8/Relu6_model/model/batch_normalization_12/FusedBatchNormV3_model/model/batch_normalization_16/FusedBatchNormV3_model/model/depthwise_conv2d_5/depthwise_model/model/conv2d_31/Conv2D_model/model/conv2d_8/Conv2D:0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="1261312616_const" type="Const" version="opset1">
			<data element_type="f16" offset="32896" shape="144,1,1,5,5" size="7200"/>
			<output>
				<port id="0" names="depthwise_4/filter_in:0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="depthwise_4" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_4:0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Add_9/y/EltwiseUnsqueeze5574_const" type="Const" version="opset1">
			<data element_type="f16" offset="40096" shape="1,144,1,1" size="288"/>
			<output>
				<port id="0" names="Add_9/y:0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Add_9" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_9:0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="model/model/tf.nn.relu6_9/Relu6_model/model/batch_normalization_13/FusedBatchNormV3_model/model/batch_normalization_16/FusedBatchNormV3_model/model/depthwise_conv2d_5/depthwise_model/model/conv2d_31/Conv2D_model/model/depthwise_conv2d_4/depthwise" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model/model/tf.nn.relu6_9/Relu6_model/model/batch_normalization_13/FusedBatchNormV3_model/model/batch_normalization_16/FusedBatchNormV3_model/model/depthwise_conv2d_5/depthwise_model/model/conv2d_31/Conv2D_model/model/depthwise_conv2d_4/depthwise:0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Conv2D_9/Transpose8020_const" type="Const" version="opset1">
			<data element_type="f16" offset="40384" shape="24,144,1,1" size="6912"/>
			<output>
				<port id="0" names="Conv2D_9/filter:0" precision="FP16">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Conv2D_9" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_9:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="model/model/batch_normalization_14/FusedBatchNormV3_model/model/conv2d_9/Conv2D1/y/EltwiseUnsqueeze5578_const" type="Const" version="opset1">
			<data element_type="f16" offset="47296" shape="1,24,1,1" size="48"/>
			<output>
				<port id="0" names="model/model/batch_normalization_14/FusedBatchNormV3_model/model/conv2d_9/Conv2D1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="model/model/batch_normalization_14/FusedBatchNormV3_model/model/conv2d_9/Conv2D1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/model/batch_normalization_14/FusedBatchNormV3_model/model/conv2d_9/Conv2D1:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="model/model/tf.__operators__.add_1/AddV2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/model/tf.__operators__.add_1/AddV2:0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv2D_10/Transpose8024_const" type="Const" version="opset1">
			<data element_type="f16" offset="47344" shape="144,24,1,1" size="6912"/>
			<output>
				<port id="0" names="Conv2D_10/filter:0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv2D_10" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_10:0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Add_10/y/EltwiseUnsqueeze5582_const" type="Const" version="opset1">
			<data element_type="f16" offset="54256" shape="1,144,1,1" size="288"/>
			<output>
				<port id="0" names="Add_10/y:0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Add_10" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_10:0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="model/model/tf.nn.relu6_10/Relu6_model/model/batch_normalization_15/FusedBatchNormV3_model/model/batch_normalization_16/FusedBatchNormV3_model/model/depthwise_conv2d_5/depthwise_model/model/conv2d_31/Conv2D_model/model/conv2d_10/Conv2D" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model/model/tf.nn.relu6_10/Relu6_model/model/batch_normalization_15/FusedBatchNormV3_model/model/batch_normalization_16/FusedBatchNormV3_model/model/depthwise_conv2d_5/depthwise_model/model/conv2d_31/Conv2D_model/model/conv2d_10/Conv2D:0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="1262112624_const" type="Const" version="opset1">
			<data element_type="f16" offset="54544" shape="144,1,1,3,3" size="2592"/>
			<output>
				<port id="0" names="depthwise_5/filter_in:0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="depthwise_5" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_5:0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Add_11/y/EltwiseUnsqueeze5586_const" type="Const" version="opset1">
			<data element_type="f16" offset="57136" shape="1,144,1,1" size="288"/>
			<output>
				<port id="0" names="Add_11/y:0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Add_11" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_11:0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="model/model/tf.nn.relu6_11/Relu6_model/model/batch_normalization_16/FusedBatchNormV3_model/model/depthwise_conv2d_5/depthwise_model/model/conv2d_31/Conv2D" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model/model/tf.nn.relu6_11/Relu6_model/model/batch_normalization_16/FusedBatchNormV3_model/model/depthwise_conv2d_5/depthwise_model/model/conv2d_31/Conv2D:0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Conv2D_11/Transpose8032_const" type="Const" version="opset1">
			<data element_type="f16" offset="57424" shape="40,144,1,1" size="11520"/>
			<output>
				<port id="0" names="Conv2D_11/filter:0" precision="FP16">
					<dim>40</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Conv2D_11" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>40</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_11:0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="model/model/batch_normalization_17/FusedBatchNormV3_model/model/conv2d_15/Conv2D_model/model/conv2d_11/Conv2D1/y/EltwiseUnsqueeze5590_const" type="Const" version="opset1">
			<data element_type="f16" offset="68944" shape="1,40,1,1" size="80"/>
			<output>
				<port id="0" names="model/model/batch_normalization_17/FusedBatchNormV3_model/model/conv2d_15/Conv2D_model/model/conv2d_11/Conv2D1/y:0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="model/model/batch_normalization_17/FusedBatchNormV3_model/model/conv2d_15/Conv2D_model/model/conv2d_11/Conv2D1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/model/batch_normalization_17/FusedBatchNormV3_model/model/conv2d_15/Conv2D_model/model/conv2d_11/Conv2D1:0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv2D_12/Transpose8036_const" type="Const" version="opset1">
			<data element_type="f16" offset="69024" shape="240,40,1,1" size="19200"/>
			<output>
				<port id="0" names="Conv2D_12/filter:0" precision="FP16">
					<dim>240</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Conv2D_12" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>240</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv2D_12:0" precision="FP16">
					<dim>1</dim>
					<dim>240</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Add_12/y/EltwiseUnsqueeze5594_const" type="Const" version="opset1">
			<data element_type="f16" offset="88224" shape="1,240,1,1" size="480"/>
			<output>
				<port id="0" names="Add_12/y:0" precision="FP16">
					<dim>1</dim>
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Add_12" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_12:0" precision="FP16">
					<dim>1</dim>
					<dim>240</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="model/model/tf.nn.relu6_12/Relu6_model/model/batch_normalization_18/FusedBatchNormV3_model/model/batch_normalization_25/FusedBatchNormV3_model/model/depthwise_conv2d_8/depthwise_model/model/conv2d_12/Conv2D" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model/model/tf.nn.relu6_12/Relu6_model/model/batch_normalization_18/FusedBatchNormV3_model/model/batch_normalization_25/FusedBatchNormV3_model/model/depthwise_conv2d_8/depthwise_model/model/conv2d_12/Conv2D:0" precision="FP16">
					<dim>1</dim>
					<dim>240</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="1264512648_const" type="Const" version="opset1">
			<data element_type="f16" offset="88704" shape="240,1,1,3,3" size="4320"/>
			<output>
				<port id="0" names="depthwise_6/filter_in:0" precision="FP16">
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="depthwise_6" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="depthwise_6:0" precision="FP16">
					<dim>1</dim>
					<dim>240</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Add_13/y/EltwiseUnsqueeze5598_const" type="Const" version="opset1">
			<data element_type="f16" offset="93024" shape="1,240,1,1" size="480"/>
			<output>
				<port id="0" names="Add_13/y:0" precision="FP16">
					<dim>1</dim>
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Add_13" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>240</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Add_13:0" precision="FP16">
					<dim>1</dim>
					<dim>240</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="model/model/tf.nn.relu6_13/Relu6_model/model/batch_normalization_19/FusedBatchNormV3_model/model/batch_normalization_25/FusedBatchNormV3_model/model/depthwise_conv2d_8/depthwise_model/model/depthwise_conv2d_6/depthwise" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model/model/tf.nn.relu6_13/Relu6_model/model/batch_normalization_19/FusedBatchNormV3_model/model/batch_normalization_25/FusedBatchNormV3_model/model/depthwise_conv2d_8/depthwise_model/model/depthwise_conv2d_6/depthwise:0" precision="FP16">
					<dim>1</dim>
